run/030-pbi2-bii3-channel/0/p
FoamFile {version 2.0; format ascii; class volScalarField; object p;}
dimensions    [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField {
  "(INLET|OUTLET|WALL)" {type calculated; value uniform 101325;}
  FRONTBACK {type empty;}
}
