run/030-pbi2-bii3-channel/system/decomposeParDict
FoamFile {version 2.0; format ascii; class dictionary; object decomposeParDict;}
numberOfSubdomains 4; method simple; simpleCoeffs {n (4 1 1); delta .001;}
