run/030-pbi2-bii3-channel/system/fvSchemes
FoamFile {version 2.0; format ascii; class dictionary; object fvSchemes;}
ddtSchemes {default Euler;}
gradSchemes {default Gauss linear;}
divSchemes {default none; div(phi,Y_PbI2_g) Gauss upwind; div(phi,Y_BiI3_g) Gauss upwind;}
laplacianSchemes {default Gauss linear corrected;}
interpolationSchemes {default linear;}
snGradSchemes {default corrected;}
